# BuiltInFailures.KeynoteFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..KeynoteFailures Properties
BuiltInFailures..::..KeynoteFailures Class See Also
---
The BuiltInFailures..::..KeynoteFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MissKeynoteParameter | No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system. |
| MissKeynotingSystem | No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family. |
| NotAssociatedKeynoteParameter | Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system. |

# See Also
BuiltInFailures..::..KeynoteFailures Class
Autodesk.Revit.DB Namespace